#+title: org-roam

*** I just removed all of the =org-roam.db= files on my filesystem

I *think* that is okay because the source of truth is my org files... but uhh lol we'll see.

So now that I've been in this roam file for a bit I think my filesystem should have one:

#+name: look-for-org-roam-dbs
#+begin_src sh
fd -F org-roam.db
#+end_src

#+call: look-for-org-roam-dbs()

#+RESULTS:

Huh... okay let's call update ourselves:

#+begin_src emacs-lisp
(org-roam-buffer-update)
#+end_src

That errored with:

#+begin_example
progn: No buffer named *org-roam*
#+end_example

Hmm let's try the build db command:

#+begin_src emacs-lisp
(org-roam-db-build-cache)
#+end_src

#+RESULTS:
: (org-roam) total: Δ117, files-modified: Δ1, ids: Δ0, links: Δ2, tags: Δ0, titles: Δ1, refs: Δ0, deleted: Δ0

Look for roam dbs:

#+name: foo
#+begin_src sh
echo 1
#+end_src

#+call: look-for-org-roam-dbs()

#+RESULTS:

So then I shouldn't be able to autocomplete right? Nope.. sure cant. I just saved this file, does that trigger it?

#+call: look-for-org-roam-dbs()

#+RESULTS:

I'm not sure what the difference was but I called org-roam-db-build-cache interactively in this buffer and got different output:

: (org-roam) total: Δ117, files-modified: Δ117, ids: Δ0, links: Δ256, tags: Δ1, titles: Δ117, refs: Δ0, deleted: Δ0

Does autocomplete work now? I know I have a page about.. hmm that didn't work let's close the file and reopen.

[[file:20210326144748-org_roam.org][org-roam]] 

Yep... that worked. Okay so I should see the db on the file system:

#+call: look-for-org-roam-dbs()

#+RESULTS:

Whaaa...

#+begin_src sh :results verbatim
ls -h $(pwd) | grep org-roam
#+end_src

#+RESULTS:
: org-roam.db

Apparently I just can't use [[file:20210327135602-fd.org][fd]] correctly which is kinda funny since it's supposed to be a more user friendly [[file:20210327135633-find_unix.org][find]] replacement.

Anywho:

#+name: working-find
#+begin_src sh :results verbatim
find /home/cody -iname org-roam.db
#+end_src

#+RESULTS: working-find
| /home/cody/tech-roam/org-roam.db                                             |
| /home/cody/devos/profiles/develop/emacs/config/org-roam.db                   |
| /home/cody/bak/hci/.worktree/wip-flakes-niv-update-misc/testdata/org-roam.db |
| /home/cody/bak/hci/.worktree/wip-flakes-niv-update-misc/org-roam.db          |

Let's delete all of those again

#+call: working-find()

#+RESULTS:

interactively ran org-roam-db-build-cache again from within tech-roam:

#+call: working-find()

#+RESULTS:
: /home/cody/tech-roam/org-roam.db

Value of org-roam-directory in home is:

#+name: org-roam-directory-value-from-home
#+begin_src emacs-lisp
(let ((default-directory "/home/cody")) (princ org-roam-directory))
#+end_src

#+RESULTS: org-roam-directory-value-from-home
: .


***** proof I took out lexical binding before logging out 

#+begin_src sh :results verbatim
cat ~/tech-roam/.dir-locals.el
#+end_src

#+RESULTS:
: ((nil . ((org-roam-directory . ".")
: 
:          (org-roam-db-location . "./org-roam.db"))))

***** make sure

#+begin_src sh :results verbatim
cat ~/tech-roam/.dir-locals.el
#+end_src

#+RESULTS:
: ((nil . ((org-roam-directory . ".")
: 
:          (org-roam-db-location . "./org-roam.db"))))


